{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embed", 
      "attrs": {
        "input_dim": "9959", 
        "output_dim": "200"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attrs": {
        "num_outputs": "32", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[6, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[12, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[13, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[25, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[31, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[32, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 1, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[22, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul6", 
      "inputs": [[47, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[45, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul7", 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[48, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul8", 
      "inputs": [[46, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[54, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[41, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[58, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[58, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul9", 
      "inputs": [[60, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[58, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul10", 
      "inputs": [[62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[61, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul11", 
      "inputs": [[59, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 2, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[54, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul12", 
      "inputs": [[73, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[71, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul13", 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[74, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul14", 
      "inputs": [[72, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[80, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[67, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[84, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[84, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul15", 
      "inputs": [[86, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[84, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul16", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[87, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul17", 
      "inputs": [[85, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 3, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[80, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[97, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[97, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul18", 
      "inputs": [[99, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[97, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul19", 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[100, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul20", 
      "inputs": [[98, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[106, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[93, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[110, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[110, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul21", 
      "inputs": [[112, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[110, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul22", 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[113, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul23", 
      "inputs": [[111, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 4, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[106, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation43", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[123, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[123, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul24", 
      "inputs": [[125, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[123, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul25", 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[126, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation44", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul26", 
      "inputs": [[124, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[132, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[119, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[136, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation47", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[136, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul27", 
      "inputs": [[138, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation45", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation46", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[136, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul28", 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[139, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul29", 
      "inputs": [[137, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 5, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[132, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation53", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[149, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation52", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[149, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul30", 
      "inputs": [[151, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation51", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[149, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul31", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[152, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation54", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul32", 
      "inputs": [[150, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[158, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[145, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation58", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[162, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation57", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[162, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul33", 
      "inputs": [[164, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation55", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation56", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[162, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul34", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[165, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation59", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul35", 
      "inputs": [[163, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 6, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[158, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation63", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[175, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation62", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[175, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul36", 
      "inputs": [[177, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation60", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation61", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[175, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul37", 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[178, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation64", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul38", 
      "inputs": [[176, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[184, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[171, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation68", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[188, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation67", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[188, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul39", 
      "inputs": [[190, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation65", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation66", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[188, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul40", 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[191, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation69", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul41", 
      "inputs": [[189, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 7, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[184, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation73", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[201, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation72", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[201, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul42", 
      "inputs": [[203, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation70", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation71", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[201, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul43", 
      "inputs": [[205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation74", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul44", 
      "inputs": [[202, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[210, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[197, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation78", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[214, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation77", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[214, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul45", 
      "inputs": [[216, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation75", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation76", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[214, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul46", 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[217, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation79", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul47", 
      "inputs": [[215, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 8, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[210, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation83", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[227, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation82", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[227, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul48", 
      "inputs": [[229, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation80", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation81", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[227, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul49", 
      "inputs": [[231, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[230, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation84", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul50", 
      "inputs": [[228, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[236, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[223, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[237, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation88", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation87", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul51", 
      "inputs": [[242, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation85", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation86", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[240, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul52", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[243, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation89", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul53", 
      "inputs": [[241, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 9, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[236, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus36", 
      "inputs": [[250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation93", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation92", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul54", 
      "inputs": [[255, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation90", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation91", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[253, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul55", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus37", 
      "inputs": [[256, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation94", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul56", 
      "inputs": [[254, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[262, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[249, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus38", 
      "inputs": [[263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation98", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[266, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation97", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[266, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul57", 
      "inputs": [[268, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation95", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation96", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[266, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul58", 
      "inputs": [[270, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus39", 
      "inputs": [[269, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation99", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul59", 
      "inputs": [[267, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 10, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[262, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[276, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation103", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[279, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation102", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[279, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul60", 
      "inputs": [[281, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation100", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation101", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[279, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul61", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[282, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul62", 
      "inputs": [[280, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[288, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[275, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation107", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul63", 
      "inputs": [[294, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation106", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[292, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul64", 
      "inputs": [[296, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[295, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul65", 
      "inputs": [[293, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 11, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[288, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[302, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[305, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[305, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul66", 
      "inputs": [[307, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation110", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation111", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[305, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul67", 
      "inputs": [[309, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[308, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation114", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul68", 
      "inputs": [[306, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[314, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[301, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[315, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation118", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul69", 
      "inputs": [[320, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation115", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[318, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul70", 
      "inputs": [[322, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[321, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation119", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul71", 
      "inputs": [[319, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 12, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[314, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus48", 
      "inputs": [[328, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t12_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation123", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation122", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul72", 
      "inputs": [[333, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation121", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[331, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul73", 
      "inputs": [[335, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus49", 
      "inputs": [[334, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation124", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul74", 
      "inputs": [[332, 0, 0], [339, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[340, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[327, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus50", 
      "inputs": [[341, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t12_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[343, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation128", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[344, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation127", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[344, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul75", 
      "inputs": [[346, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation125", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[344, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation126", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[344, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul76", 
      "inputs": [[348, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus51", 
      "inputs": [[347, 0, 0], [350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation129", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul77", 
      "inputs": [[345, 0, 0], [352, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 13, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[340, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus52", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[356, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation133", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[357, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation132", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[357, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul78", 
      "inputs": [[359, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation130", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation131", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[357, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul79", 
      "inputs": [[361, 0, 0], [362, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus53", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation134", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[364, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul80", 
      "inputs": [[358, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[366, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[353, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus54", 
      "inputs": [[367, 0, 0], [368, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation138", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[370, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation137", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[370, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul81", 
      "inputs": [[372, 0, 0], [351, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation135", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[370, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation136", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[370, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul82", 
      "inputs": [[374, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus55", 
      "inputs": [[373, 0, 0], [376, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation139", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[377, 0, 0]]
    }, 
    {
