{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_weight", 
      "attrs": {
        "input_dim": "10000", 
        "output_dim": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embed", 
      "attrs": {
        "input_dim": "10000", 
        "output_dim": "200"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "60", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l0_begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 200)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus120", 
      "inputs": [[6, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l0_begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 200)"
      }, 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul240", 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[12, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul241", 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t0_state", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t0_out", 
      "inputs": [[13, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_i2h_bias", 
      "attrs": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t0_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l1_begin_state_0", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 200)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t0_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus180", 
      "inputs": [[25, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l1_begin_state_1", 
      "attrs": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 200)"
      }, 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul360", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[31, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul361", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t0_state", 
      "inputs": [[35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation180", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t0_out", 
      "inputs": [[32, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims60", 
      "attrs": {"axis": "1"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 1, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[22, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus121", 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[46, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[46, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul242", 
      "inputs": [[48, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[46, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul243", 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t1_state", 
      "inputs": [[49, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation121", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t1_out", 
      "inputs": [[47, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t1_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[55, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t1_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[41, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus181", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[59, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[59, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul362", 
      "inputs": [[61, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[59, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul363", 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t1_state", 
      "inputs": [[62, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation181", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t1_out", 
      "inputs": [[60, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims61", 
      "attrs": {"axis": "1"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t2_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 2, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t2_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[55, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus122", 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[73, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[73, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul244", 
      "inputs": [[75, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[73, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul245", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t2_state", 
      "inputs": [[76, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation122", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t2_out", 
      "inputs": [[74, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t2_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[82, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t2_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[68, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus182", 
      "inputs": [[83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul364", 
      "inputs": [[88, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[86, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul365", 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t2_state", 
      "inputs": [[89, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation182", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t2_out", 
      "inputs": [[87, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims62", 
      "attrs": {"axis": "1"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t3_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 3, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t3_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[82, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus123", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[100, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[100, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul246", 
      "inputs": [[102, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[100, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul247", 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t3_state", 
      "inputs": [[103, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation123", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t3_out", 
      "inputs": [[101, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t3_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[109, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t3_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[95, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus183", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t3_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[113, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[113, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul366", 
      "inputs": [[115, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[113, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul367", 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t3_state", 
      "inputs": [[116, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation183", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t3_out", 
      "inputs": [[114, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims63", 
      "attrs": {"axis": "1"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t4_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 4, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t4_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[109, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus124", 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[127, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[127, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul248", 
      "inputs": [[129, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[127, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul249", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t4_state", 
      "inputs": [[130, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation124", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t4_out", 
      "inputs": [[128, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t4_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[136, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t4_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[122, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus184", 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t4_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[140, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[140, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul368", 
      "inputs": [[142, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[140, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul369", 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t4_state", 
      "inputs": [[143, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation184", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t4_out", 
      "inputs": [[141, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims64", 
      "attrs": {"axis": "1"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t5_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 5, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t5_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[136, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus125", 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t5_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[154, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[154, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul250", 
      "inputs": [[156, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[154, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul251", 
      "inputs": [[158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t5_state", 
      "inputs": [[157, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation125", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t5_out", 
      "inputs": [[155, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t5_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[163, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t5_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[149, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus185", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t5_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[167, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[167, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul370", 
      "inputs": [[169, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[167, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul371", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t5_state", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation185", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t5_out", 
      "inputs": [[168, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims65", 
      "attrs": {"axis": "1"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t6_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 6, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t6_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[163, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus126", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t6_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul252", 
      "inputs": [[183, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[181, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul253", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t6_state", 
      "inputs": [[184, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation126", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t6_out", 
      "inputs": [[182, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t6_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[190, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t6_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[176, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus186", 
      "inputs": [[191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t6_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul372", 
      "inputs": [[196, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[194, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul373", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t6_state", 
      "inputs": [[197, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation186", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t6_out", 
      "inputs": [[195, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims66", 
      "attrs": {"axis": "1"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t7_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 7, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t7_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[190, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus127", 
      "inputs": [[205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t7_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[208, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[208, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul254", 
      "inputs": [[210, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[208, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul255", 
      "inputs": [[212, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t7_state", 
      "inputs": [[211, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation127", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t7_out", 
      "inputs": [[209, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t7_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[217, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t7_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[203, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus187", 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t7_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul374", 
      "inputs": [[223, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[221, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul375", 
      "inputs": [[225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t7_state", 
      "inputs": [[224, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation187", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t7_out", 
      "inputs": [[222, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims67", 
      "attrs": {"axis": "1"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t8_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 8, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t8_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[217, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus128", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t8_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[235, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[235, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul256", 
      "inputs": [[237, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[235, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul257", 
      "inputs": [[239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t8_state", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation128", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t8_out", 
      "inputs": [[236, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t8_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[244, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t8_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[230, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus188", 
      "inputs": [[245, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t8_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[248, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[248, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul376", 
      "inputs": [[250, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[248, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul377", 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t8_state", 
      "inputs": [[251, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation188", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t8_out", 
      "inputs": [[249, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims68", 
      "attrs": {"axis": "1"}, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t9_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 9, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t9_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[244, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus129", 
      "inputs": [[259, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t9_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[262, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[262, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul258", 
      "inputs": [[264, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[262, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul259", 
      "inputs": [[266, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t9_state", 
      "inputs": [[265, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation129", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t9_out", 
      "inputs": [[263, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t9_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[271, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t9_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[257, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus189", 
      "inputs": [[272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t9_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[275, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[275, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul378", 
      "inputs": [[277, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[275, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul379", 
      "inputs": [[279, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t9_state", 
      "inputs": [[278, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation189", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t9_out", 
      "inputs": [[276, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims69", 
      "attrs": {"axis": "1"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t10_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 10, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t10_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[271, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus130", 
      "inputs": [[286, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t10_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[289, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[289, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul260", 
      "inputs": [[291, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[289, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul261", 
      "inputs": [[293, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t10_state", 
      "inputs": [[292, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation130", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t10_out", 
      "inputs": [[290, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t10_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[298, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t10_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[284, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus190", 
      "inputs": [[299, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t10_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul380", 
      "inputs": [[304, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[302, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul381", 
      "inputs": [[306, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t10_state", 
      "inputs": [[305, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation190", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t10_out", 
      "inputs": [[303, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims70", 
      "attrs": {"axis": "1"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t11_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 11, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t11_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[298, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus131", 
      "inputs": [[313, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t11_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[316, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[316, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul262", 
      "inputs": [[318, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[316, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul263", 
      "inputs": [[320, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t11_state", 
      "inputs": [[319, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation131", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t11_out", 
      "inputs": [[317, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t11_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[325, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t11_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[311, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus191", 
      "inputs": [[326, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t11_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[329, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[329, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul382", 
      "inputs": [[331, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[329, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul383", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t11_state", 
      "inputs": [[332, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation191", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t11_out", 
      "inputs": [[330, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims71", 
      "attrs": {"axis": "1"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t12_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[3, 12, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t12_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[325, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus132", 
      "inputs": [[340, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t12_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[342, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[343, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[343, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul264", 
      "inputs": [[345, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[343, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[343, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul265", 
      "inputs": [[347, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t12_state", 
      "inputs": [[346, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation132", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l0_t12_out", 
      "inputs": [[344, 0, 0], [351, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t12_i2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[352, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t12_h2h", 
      "attrs": {"num_hidden": "800"}, 
      "inputs": [[338, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus192", 
      "inputs": [[353, 0, 0], [354, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t12_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[355, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t12_o", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[356, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t12_f", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[356, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul384", 
      "inputs": [[358, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t12_i", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[356, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t12_c", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[356, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul385", 
      "inputs": [[360, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t12_state", 
      "inputs": [[359, 0, 0], [362, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation192", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "lstm_l1_t12_out", 
      "inputs": [[357, 0, 0], [364, 0, 0]]
    }, 
    {
