{
  "nodes": [
    {
      "op": "null", 
      "name": "target", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "target_embed_weight", 
      "attrs": {"__shape__": "(22666, 512)"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "target_embed_embed", 
      "attrs": {
        "input_dim": "22666", 
        "output_dim": "512"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar7", 
      "attrs": {"scalar": "22.627416997969522"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "target_pos_embed_positional_encodings", 
      "attrs": {
        "depth": "512", 
        "length": "100", 
        "op_type": "positional_encodings"
      }, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad2", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[3, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decoder_transformer_0_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split7", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar8", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape51", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose24", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape52", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape53", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[9, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose25", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape54", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "decoder_transformer_0_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[13, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "decoder_transformer_target_bias", 
      "attrs": {
        "length": "100", 
        "op_type": "auto_regressive_bias"
      }, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "decoder_transformer_0_att_self_bias_add", 
      "inputs": [[17, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax6", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape55", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[9, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose26", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape56", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "decoder_transformer_0_att_self_contexts", 
      "inputs": [[21, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape57", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose27", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape58", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected18", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "decoder_transformer_0_att_self_post_residual", 
      "inputs": [[30, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean24", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "decoder_transformer_0_att_self_post_norminp_minus_mean", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus12", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square12", 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean25", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar12", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt12", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "decoder_transformer_0_att_self_post_norminp_norm", 
      "inputs": [[33, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "decoder_transformer_0_att_self_post_norminp_norm_scaled", 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "decoder_transformer_0_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_enc_q2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decoder_transformer_0_att_enc_q_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar9", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape59", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose28", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape60", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "source", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "source_embed_factor_split", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "source_embed_weight", 
      "attrs": {"__shape__": "(29350, 512)"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "source_embed_embed", 
      "attrs": {
        "input_dim": "29350", 
        "output_dim": "512"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "22.627416997969522"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "source_pos_embed_positional_encodings", 
      "attrs": {
        "depth": "512", 
        "length": "100", 
        "op_type": "positional_encodings"
      }, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[54, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_0_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[60, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_0_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[64, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "_zeros0", 
      "attrs": {
        "dtype": "float32", 
        "shape": "(1,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_not_equal", 
      "name": "broadcast_not_equal0", 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "custom0", 
      "attrs": {
        "max_length": "100", 
        "op_type": "variable_length_bias"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "broadcast_to0", 
      "attrs": {"shape": "[0, 8, 0]"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "[-3, 0]"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "encoder_transformer_biasbias", 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_0_att_self_bias_add", 
      "inputs": [[68, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[60, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape7", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_0_att_self_contexts", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_0_att_self_post_residual", 
      "inputs": [[89, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_0_att_self_post_norminp_minus_mean", 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus0", 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt0", 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_0_att_self_post_norminp_norm", 
      "inputs": [[92, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_0_att_self_post_norminp_norm_scaled", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_0_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "2048"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_h2o_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_0_ff_post_residual", 
      "inputs": [[109, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean2", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_0_ff_post_norminp_minus_mean", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus1", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square1", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean3", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt1", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_0_ff_post_norminp_norm", 
      "inputs": [[112, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_0_ff_post_norminp_norm_scaled", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_0_ff_post_norminp_norm_scaled_shifted", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_1_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split2", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape10", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose4", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape11", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[125, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose5", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_1_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[129, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_1_att_self_bias_add", 
      "inputs": [[133, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax1", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape14", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[125, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose6", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape15", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_1_att_self_contexts", 
      "inputs": [[135, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape16", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose7", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_1_att_self_post_residual", 
      "inputs": [[144, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean4", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_1_att_self_post_norminp_minus_mean", 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus2", 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square2", 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean5", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt2", 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_1_att_self_post_norminp_norm", 
      "inputs": [[147, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_1_att_self_post_norminp_norm_scaled", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_1_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "2048"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_h2o_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_1_ff_post_residual", 
      "inputs": [[164, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean6", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_1_ff_post_norminp_minus_mean", 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus3", 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square3", 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean7", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt3", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_1_ff_post_norminp_norm", 
      "inputs": [[167, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_1_ff_post_norminp_norm_scaled", 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_1_ff_post_norminp_norm_scaled_shifted", 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_2_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split3", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape18", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose8", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape19", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape20", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[180, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose9", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_2_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[184, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_2_att_self_bias_add", 
      "inputs": [[188, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax2", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape22", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[180, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose10", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape23", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_2_att_self_contexts", 
      "inputs": [[190, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape24", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose11", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_2_att_self_post_residual", 
      "inputs": [[199, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean8", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_2_att_self_post_norminp_minus_mean", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus4", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square4", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean9", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar4", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt4", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_2_att_self_post_norminp_norm", 
      "inputs": [[202, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_2_att_self_post_norminp_norm_scaled", 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_2_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "2048"
      }, 
      "inputs": [[212, 0, 0], [213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_h2o_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected8", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[216, 0, 0], [217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_2_ff_post_residual", 
      "inputs": [[219, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean10", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_2_ff_post_norminp_minus_mean", 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus5", 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square5", 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean11", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar5", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt5", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_2_ff_post_norminp_norm", 
      "inputs": [[222, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_2_ff_post_norminp_norm_scaled", 
      "inputs": [[228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_2_ff_post_norminp_norm_scaled_shifted", 
      "inputs": [[230, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_3_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split4", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape26", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose12", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape27", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape28", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[235, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose13", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_3_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[239, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_3_att_self_bias_add", 
      "inputs": [[243, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax3", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape30", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[235, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose14", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape31", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_3_att_self_contexts", 
      "inputs": [[245, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape32", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose15", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected9", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_3_att_self_post_residual", 
      "inputs": [[254, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean12", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_3_att_self_post_norminp_minus_mean", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus6", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square6", 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean13", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar6", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt6", 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_3_att_self_post_norminp_norm", 
      "inputs": [[257, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_3_att_self_post_norminp_norm_scaled", 
      "inputs": [[263, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_3_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected10", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "2048"
      }, 
      "inputs": [[267, 0, 0], [268, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_h2o_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected11", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "512"
      }, 
      "inputs": [[271, 0, 0], [272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_3_ff_post_residual", 
      "inputs": [[274, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean14", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_3_ff_post_norminp_minus_mean", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus7", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square7", 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean15", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar7", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt7", 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_3_ff_post_norminp_norm", 
      "inputs": [[277, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_3_ff_post_norminp_norm_scaled", 
      "inputs": [[283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_3_ff_post_norminp_norm_scaled_shifted", 
      "inputs": [[285, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_att_self_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_4_att_self_qkv_transform", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "1536"
      }, 
      "inputs": [[287, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split5", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar5", 
      "attrs": {"scalar": "0.125"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape34", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose16", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape36", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[290, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose17", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape37", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_4_att_self_dot", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[294, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_4_att_self_bias_add", 
      "inputs": [[298, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax4", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape38", 
      "attrs": {"shape": "(0, -1, 8, 64)"}, 
      "inputs": [[290, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose18", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape39", 
      "attrs": {"shape": "(-3, -1, 64)"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_4_att_self_contexts", 
      "inputs": [[300, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape40", 
      "attrs": {"shape": "(-4, -1, 8, 0, 64)"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose19", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape41", 
      "attrs": {"shape": "(-1, 0, 512)"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_att_self_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected12", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "512"
      }, 
      "inputs": [[307, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_4_att_self_post_residual", 
      "inputs": [[309, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean16", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "encoder_transformer_4_att_self_post_norminp_minus_mean", 
      "inputs": [[310, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_minus8", 
      "inputs": [[310, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square8", 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean17", 
      "attrs": {
        "axis": "-1", 
        "keepdims": "True"
      }, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar8", 
      "attrs": {"scalar": "1e-06"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "rsqrt", 
      "name": "rsqrt8", 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_4_att_self_post_norminp_norm", 
      "inputs": [[312, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_att_self_post_norm_gamma", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "encoder_transformer_4_att_self_post_norminp_norm_scaled", 
      "inputs": [[318, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_att_self_post_norm_beta", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_4_att_self_post_norminp_norm_scaled_shifted", 
      "inputs": [[320, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_ff_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_ff_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected13", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "2048"
      }, 
      "inputs": [[322, 0, 0], [323, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_ff_h2o_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_4_ff_h2o_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected14", 
      "attrs": {
        "flatten": "False", 
        "num_hidden": "512"
      }, 
